from time import sleep
import random

def delayPrint(s):
    for c in s:
        print(c, end='', flush=True)
        sleep(0.025)
    print('')

character_name = str(input("Введіть ім'я персонажа: "))

if len(character_name) > 18:
    delayPrint("Ім'я персонажа задовге")

delayPrint(f"{character_name} знаходиться в тихому містечку біля джерела загадкового магічного водоспаду. Повітря наповнене магією,\nі гравець відчуває в себі палке бажання досліджувати цю землю пригод.")

choice = int(input("1. Відправитися до місцевої магічної гільдії і дізнатися більше про магію.\n2. Пройтися по тихому лісі, що оточує містечко, в пошуках загадок і пригод.\n"))

match choice:
    case 1:
        delayPrint("Ви вирушаєте до місцевої магічної гільдії, де таємничі чарівники інструктують вас щодо потужності магії у цьому світі.")
        
        guild_choice = int(input("1. Приєднатися до гільдії та вивчати магію разом з ними.\n2. Подякувати за інформацію та вирушити в далекі подорожі.\n"))

        match guild_choice:
            case 1:
                delayPrint(f"{character_name} стає учнем магічної гільдії. Під час навчання ви отримуєте надзвичайні здібності та заклинання.")
                
                training_choice = int(input("1. Вивчити новий потужний магічний заклинання.\n2. Взяти участь у внутрішньогільдійному турнірі.\n"))

                match training_choice:
                    case 1:
                        delayPrint("Ви успішно вивчаєте новий потужний магічний заклинання, що може змінити хід подій у світі.")
                    case 2:
                        delayPrint("У внутрішньогільдійному турнірі ви демонструєте свої магічні вміння та отримуєте шанс стати лідером гільдії.")
                        
            case 2:
                delayPrint(f"{character_name} подякувавши за інформацію, вирушає в далекі подорожі, несучи з собою знання про магію.")
                
    case 2:
        delayPrint("Ви вирушаєте в тихий ліс, де кожне дерево ідеально вирівняне, а звірі розмовляють людською мовою. Ліс приховує багато таємниць.")

        forest_choice = int(input("1. Розгадати загадку та знайти схованки лісу.\n2. Спробувати спілкуватися з розумним ведмедем, який вас випадково зустрів.\n"))

        match forest_choice:
            case 1:
                delayPrint(f"{character_name} розгадавши загадку, відкриває схованки лісу, де знаходяться втрачені скарби та магічні реліквії.")
                
            case 2:
                delayPrint("Ви починаєте спілкуватися з розумним ведмедем, який вас вчить мові тварин та дарує вам магічний амулет.")
                
                amulet_choice = int(input("1. Вивчити, як використовувати магічний амулет.\n2. Подякувати ведмедеві та продовжити подорож лісом.\n"))

                match amulet_choice:
                    case 1:
                        delayPrint("Ви вивчаєте, як використовувати магічний амулет, що надає вам захист та можливість збільшити свої здібності.")
                        
                    case 2:
                        delayPrint(f"{character_name} подякувавши ведмедеві, продовжує свою подорож лісом з новими друзями серед тварин.")
